Revit 2024 API
FabricationItemFile Class
 This class holds information about the item file, including whether it is already loaded from disk into Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public class FabricationItemFile : IDisposable
Visual Basic
Public Class FabricationItemFile _
	Implements IDisposable
Visual C++
public ref class FabricationItemFile : IDisposable
Remarks
 This object is created as a result of loading from disk.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationItemFile
See Also
FabricationItemFile Members
Autodesk.Revit.DB Namespace